In [ ]:
В данном документе представлена информация о классах Series и Data

In [78]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [79]:
obj = Series([2,3,5,4])

In [80]:
obj.values.__class__

numpy.ndarray

In [81]:
obj2 = Series([2,3,5,4], index = ["a", "b", "C", "d"])

In [82]:
obj2

a    2
b    3
C    5
d    4
dtype: int64

In [83]:
obj2.index

Index(['a', 'b', 'C', 'd'], dtype='object')

In [84]:
obj2["a"]

2

In [85]:
obj2[obj2 > 3]

C    5
d    4
dtype: int64

In [86]:
np.exp(obj2)

a      7.389056
b     20.085537
C    148.413159
d     54.598150
dtype: float64

In [87]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = Series(sdata)

In [88]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [89]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

Это просто текст

In [90]:
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)

In [91]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [92]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [93]:
obj4.notna()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [94]:
obj4.name = "fff"
print(obj4.name)

fff

In [95]:
obj4.index.name = "malo"
print(obj4.index.name)

malo

In [96]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [97]:
obj

Bob      2
Steve    3
Jeff     5
Ryan     4
dtype: int64

DataFrame

In [98]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"], "year": [2000, 2001, 2002, 2001, 2002, 2003], "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [99]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

frame.head() - первые 5 строк, tail() - последние 5

In [100]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [101]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [102]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", ""])
frame2

   year   state  pop
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [103]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [104]:
frame2["year"]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [105]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [106]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
          NaN
Name: 1, dtype: object

In [107]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
          NaN
Name: 2, dtype: object

In [108]:
frame2[""] = 16.5

In [109]:
frame2

   year   state  pop
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [110]:
frame2[""]

0    16.5
1    16.5
2    16.5
3    16.5
4    16.5
5    16.5
Name: , dtype: float64

In [111]:
frame2["Просто столбец"] = frame2["state"]

In [112]:
frame2

   year   state  pop       Просто столбец
0  2000    Ohio  1.5  16.5           Ohio
1  2001    Ohio  1.7  16.5           Ohio
2  2002    Ohio  3.6  16.5           Ohio
3  2001  Nevada  2.4  16.5         Nevada
4  2002  Nevada  2.9  16.5         Nevada
5  2003  Nevada  3.2  16.5         Nevada

In [113]:
frame2["Просто столбец"] = frame2["state"] == "Ohio"

In [114]:
frame2

   year   state  pop        Просто столбец
0  2000    Ohio  1.5  16.5            True
1  2001    Ohio  1.7  16.5            True
2  2002    Ohio  3.6  16.5            True
3  2001  Nevada  2.4  16.5           False
4  2002  Nevada  2.9  16.5           False
5  2003  Nevada  3.2  16.5           False

In [115]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
"Nevada": {2001: 2.4, 2002: 2.9}}

In [116]:
frame3 = DataFrame(populations)

In [117]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [118]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [119]:
pd.DataFrame(populations, index=[2000, 2011, 2012])

      Ohio  Nevada
2000   1.5     NaN
2011   NaN     NaN
2012   NaN     NaN

In [120]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

Индексные объекты

In [121]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [122]:
obj

a    0
b    1
c    2
dtype: int32

In [123]:
labels = np.arange(3)

In [124]:
obj2 = pd.Series([1.2, -2.1, 3], index=labels)
obj2

0    1.2
1   -2.1
2    3.0
dtype: float64

In [125]:
obj2.index is labels

False

In [126]:
obj2.index

Index([0, 1, 2], dtype='int32')

In [127]:
labels

array([0, 1, 2])

In [128]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [129]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [130]:
"Ohio" in frame3

True

In [131]:
2000 in frame3

False

In [132]:
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

Переиндексация

In [133]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [134]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [135]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [136]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [137]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [138]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [139]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [140]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=["a", "c", "d"], columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [141]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [142]:
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [143]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Удаление элементов из оси

In [144]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [145]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [146]:
new_obj = obj.drop("c")

In [147]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [148]:
new_obj = obj.drop(["a", "b"])

In [149]:
new_obj

c    2.0
d    3.0
e    4.0
dtype: float64

In [150]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=["Ohio", "Colorado", "Utah", "New York"], columns=["one", "two", "three", "four"])

In [151]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [155]:
data.drop(index=["Ohio", "New York"])

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [156]:
data.drop(["one", "three"], axis=1)

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15